Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/svd/PIC32CK2051GC01144.svd
               <register>
                  <name>TXCSRL_PERIPHERAL_EPX_MODE</name>
                  <description>ENDPOINTX Control And Status Bits for TX Endpoints 1-15</description>
                  <alternateRegister>TXCSRL_HOST_EPX_MODE</alternateRegister>
                  <addressOffset>0x1012</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TXPKTRDY</name>
                        <description>The CPU Sets This Bit After Loading A Data Packet Into The FIFO.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFONOTEMPTY</name>
                        <description>The USB Sets This Bit When There Is At Least 1 Packet In The TX FIFO.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UNDERRUN</name>
                        <description>The USB Sets This Bit If An In Token Is Received When TxPktRdy Is Not Set.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FLUSHFIFO</name>
                        <description>The CPU Writes A 1 To This Bit To Flush The Latest Packet From The Endpoint TX FIFO</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SENDSTALL</name>
                        <description>The CPU Writes A 1 To This Bit To Issue A Stall Handshake To An In Token</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SENTSTALL</name>
                        <description>This Bit Is Set When A Stall Handshake Is Transmitted.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLRDATATOG</name>
                        <description>The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INCOMPTX</name>
                        <description>When The Endpoint Is Being Used For High-Bandwidth Isochronous, This Bit Is Set To Indicate Where A Large Packet Has Been Split Into 2 Or 3 Packets For Transmission But Insufficient IN Tokens Have Been Received To Send All The Parts.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXCSRH_HOST_EPX_MODE</name>
                  <description>ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15</description>
                  <addressOffset>0x1013</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DATATOGGLE</name>
                        <description>When Read, This Bit Indicates The Current State Of The Endpoint</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATATOGGLEWRENABLE</name>
                        <description>The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQMODE</name>
                        <description>The CPU Sets This Bit To Select DMA Request Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRCDATATOG</name>
                        <description>The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packe</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQENAB</name>
                        <description>The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>The CPU Sets This Bit To Enable The Endpoint Direction As TX</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTOSET</name>
                        <description>If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum P</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXCSRH_PERIPHERAL_EPX_MODE</name>
                  <description>ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15</description>
                  <alternateRegister>TXCSRH_HOST_EPX_MODE</alternateRegister>
                  <addressOffset>0x1013</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DMAREQMODE</name>
                        <description>The CPU Sets This Bit To Select DMA Request Mode 1 And Clears It To Select DMA Request Mode 0.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRCDATATOG</name>
                        <description>The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packet To Be Cleared From The FIFO.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQENAB</name>
                        <description>The CPU Sets This Bit To Enable The DMA Request For The TX Endpoint</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>The CPU Sets This Bit To Enable The Endpoint Direction As TX</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ISO</name>
                        <description>The CPU Sets This Bit To Enable The TX Endpoint For Isochronous Transfers</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTOSET</name>
                        <description>If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum Packet Size Is Loaded Into The TX FIFO.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXMAXP</name>
                  <description>ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected RX Endpoint In A Single Operation</description>
                  <addressOffset>0x1014</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>MAXPAYLOAD</name>
                        <description>Maximum Payload/Transactions</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>MULTIPLIER</name>
                        <description>Multiplier Value (m-1)</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXCSRL_HOST_EPX_MODE</name>
                  <description>ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15</description>
                  <addressOffset>0x1016</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXPKTRDY</name>
                        <description>This Bit Is Set When A Data Packet Has Been Received.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOFULL</name>
                        <description>This Bit Is Set When No More Packets Can Be Loaded</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>The USB Sets This Bit When 3 Attempts Have Been Made To Receive A Packet And No Data Packet Has Been Received.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAKTIMEOUT</name>
                        <description>This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FLUSHFIFO</name>
                        <description>The CPU Writes A 1 To This Bit To Flush The Next Packet To Be Read From The Endpoint Rx FIFO</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>REQPKT</name>
                        <description>The CPU Writes A 1 To This Bit To Request An IN Transaction.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXSTALL</name>
                        <description>When A STALL Handshake Is Received, This Bit Is Set And An Interrupt Is Generated.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLRDATATOG</name>
                        <description>The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXCSRL_PERIPHERAL_EPX_MODE</name>
                  <description>ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15</description>
                  <alternateRegister>RXCSRL_HOST_EPX_MODE</alternateRegister>
                  <addressOffset>0x1016</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXPKTRDY</name>
                        <description>This Bit Is Set When A Data Packet Has Been Received.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOFULL</name>
                        <description>This Bit Is Set When No More Packets Can Be Loaded Into The Rx FIFO.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVERRUN</name>
                        <description>This Bit Is Set If An OUT Packet Cannot Be Loaded Into The Rx FIFO.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATAERROR</name>
                        <description>This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FLUSHFIFO</name>
                        <description>The CPU Writes A 1 To This Bit To Flush The Next Packet To Be Read From The Endpoint Rx FIFO</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SENDSTALL</name>
                        <description>The CPU Writes A 1 To This Bit To Issue A STALL Handshake.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SENTSTALL</name>
                        <description>This Bit Is Set When A STALL Handshake Is Transmitted.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLRDATATOG</name>
                        <description>The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXCSRH_HOST_EPX_MODE</name>
                  <description>ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15</description>
                  <addressOffset>0x1017</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>INCOMPRX</name>
                        <description>This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATATOGGLE</name>
                        <description>When Read, This Bit Indicates The Current State Of The Endpoint</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATATOGGLEWRTENABLE</name>
                        <description>The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQMODE</name>
                        <description>The CPU Sets This Bit To Select DMA Request Mode</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PIDERROR</name>
                        <description>Indicates A PID Error In The Received Packet</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQENAB</name>
                        <description>The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTOREQ</name>
                        <description>If The CPU Sets This Bit, The ReqPkt Bit Will Be Automatically Set When The RxPktRdy Bit Is Cleared.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTOCLEAR</name>
                        <description>If The CPU Sets This Bit, TxPktRdy Will Be Automatically Cleared When A Packet Of RxMaxP Bytes Has Been Unloaded From The RX FIFO</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXCSRH_PERIPHERAL_EPX_MODE</name>
                  <description>ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15</description>
                  <alternateRegister>RXCSRH_HOST_EPX_MODE</alternateRegister>
                  <addressOffset>0x1017</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>INCOMPRX</name>
                        <description>This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Because Parts Of The Data Were Not Received.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQMODE</name>
                        <description>The CPU Sets This Bit To Select DMA Request Mode</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISNYET</name>
                        <description>The CPU Sets This Bit To Disable The Sending Of NYET Handshakes</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAREQENAB</name>
                        <description>The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ISO</name>
                        <description>The CPU Sets This Bit To Enable the RX Endpoint For Isochronous Transfers</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTOCLEAR</name>
                        <description>If The CPU Sets This Bit Then The RxPktRdy Bit Will Be Automatically Cleared Whean A Packet Of RxMaxP Bytes Has Benn Unloaded Froim The Rx FIFO</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXCOUNT</name>
                  <description>ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO.</description>
                  <addressOffset>0x1018</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>ENDPOINTRXCOUNT</name>
                        <description>Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
